yelp_clone/app/views/restaurants/index.html.erb

              <% if user_signed_in? %><%= link_to "Endorse", review_endorsements_path(review), class: 'endorsements-link' %> -<%end%>
              <span class="endorsements_count"> <%= review.endorsements.count %> </span> <%= 'endorsement'.pluralize(review.endorsements.count) %>
---
SELECT COUNT(*) FROM "endorsements" WHERE "endorsements"."review_id" = $1  [["review_id", 1]]