yelp_clone/app/controllers/endorsements_controller.rb

  def create
    @review = Review.find(params[:review_id])
    @review.endorsements.create
    render json: {new_endorsement_count: @review.endorsements.count}
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "endorsements" ("review_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["review_id", 1], ["created_at", 2017-02-23 16:46:30 UTC], ["updated_at", 2017-02-23 16:46:30 UTC]]
SELECT COUNT(*) FROM "endorsements" WHERE "endorsements"."review_id" = $1  [["review_id", 1]]