yelp_clone/app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "created_at", "updated_at", "description", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "NEW NEW NEW"], ["created_at", 2017-02-22 16:49:53 UTC], ["updated_at", 2017-02-22 16:49:53 UTC], ["description", "NOT BAD"], ["user_id", 1]]

  def show
    @restaurant = Restaurant.find(params[:id])
    @reviews = Review.where(:restaurant_id=>params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 14]]