yelp_clone/app/controllers/reviews_controller.rb

  def create
    # @restaurant = Restaurant.find review_params[:restaurant_id]
    @restaurant = Restaurant.find(params[:restaurant_id])
    @review = @restaurant.build_review review_params, current_user

    if @review.save
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
INSERT INTO "reviews" ("thoughts", "rating", "created_at", "updated_at", "restaurant_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["thoughts", "dsdsdsdasdasdasd"], ["rating", 1], ["created_at", 2017-02-23 13:05:15 UTC], ["updated_at", 2017-02-23 13:05:15 UTC], ["restaurant_id", 1], ["user_id", 1]]